src/app/shared/mocks/FulfillRefresh_0802.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:Fulfill>
      <con:request>
        <data:AccountCode>123456789</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:AdditionalInputs>
          <data:Data>
            <data:Name>CreditReportVersion</data:Name>
            <data:Value>7.1</data:Value>
          </data:Data>
        </data:AdditionalInputs>
        <data:RequestKey>BC-498600ff-7ac6-47c5-8177-5651897a82a5</data:RequestKey>
        <data:ClientKey>27f7ff41-9229-4224-857a-d24ecb8804fd</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>5112 Walnut Ridge Dr</data:AddressLine1>
            <data:AddressLine2 xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:City>Des Moines</data:City>
            <data:State>IA</data:State>
            <data:Zipcode>50317</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>1944-02-01</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>Jennifer</data:FirstName>
            <data:LastName>Reintjes</data:LastName>
            <data:MiddleName>Jane</data:MiddleName>
            <data:Prefix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Suffix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:FullName>
          <data:Ssn>666305050</data:Ssn>
        </data:Customer>
        <data:EnrollmentKey>4736c410-f9c7-42e3-9fb4-6eb71eff567c</data:EnrollmentKey>
        <data:Language xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <data:ServiceBundleCode>CC2BraveCreditTUReport24Hour</data:ServiceBundleCode>
      </con:request>
    </con:Fulfill>
  </soapenv:Body>
</soapenv:Envelope>